In [1]:
import sqlite3

print(sqlite3.version)
print(sqlite3.sqlite_version)

2.6.0
3.11.0

In [2]:
# Connect to the database. Here we connect in memory not the another database
db = sqlite3.connect(':memory:')

In [3]:
# Creating a cursor to use to execute SQL statements
cursor = db.cursor()

In [4]:
cursor

In [5]:
# Using the curosr to execute SQL statements to the database

cursor.execute('''CREATE TABLE books(id INTEGER PRIMARY KEY, title TEXT, author TEXT, price TEXT, year TEXT)''')
db.commit()

In [6]:
cursor.execute('''INSERT INTO books values (1, 'Lord of the rings', 'Tolkein', 80, 1960)''')
cursor.execute('''INSERT INTO books values (2, 'Game of thrones', 'George Martin', 75, 1996)''')
db.commit()

In [7]:
lstbooks = cursor.execute('''select * from books;''').fetchall()
db.commit()
print(lstbooks)

[(1, 'Lord of the rings', 'Tolkein', '80', '1960'), (2, 'Game of thrones', 'George Martin', '75', '1996')]

In [8]:
type(lstbooks)

list

In [9]:
# Dataframes are easier to work with than list 

import sqlite3
import pandas as pd

# convert query request to dataframe

dfbook = pd.read_sql_query("SELECT * FROM books", db)
dfbook.head()

   id              title         author price  year
0   1  Lord of the rings        Tolkein    80  1960
1   2    Game of thrones  George Martin    75  1996

In [10]:
# Dropping the table
cursor = db.cursor()
cursor.execute('''DROP TABLE books''')
db.commit()

In [11]:
# check if table is droped. It shoud give and Error.
booksdf = cursor.execute('''SELECT * FROM books;''').fetchall()
db.commit()

OperationalError: no such table: books

# Chinook

In [12]:
ls

chinook.db       Python-SQL1.ipynb  realstate.csv
FLinsurance.csv  Python-SQL2.ipynb

In [13]:
conn = sqlite3.connect('chinook.db')
cur = conn.cursor()

In [14]:
albums = cur.execute('''select * from albums order by title limit 3;''').fetchall()
print(albums)

[(156, '...And Justice For All', 50), (257, '20th Century Masters - The Millennium Collection: The Best of Scorpions', 179), (296, 'A Copland Celebration, Vol. I', 230)]

In [15]:
type(albums)

list

In [16]:
import sqlite3
import pandas as pd

# convert query results to a dataframe from list

dfalbum = pd.read_sql_query("SELECT * FROM albums", conn)
dfalbum.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [17]:
pd.read_sql_query("select name from sqlite_master where type = 'table';", conn)

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

In [18]:
dftablist = pd.read_sql_query("select name from sqlite_master where type = 'table';", conn)

In [19]:
dftablist.dtypes

name    object
dtype: object

In [20]:
dftablist

               name
0            albums
1   sqlite_sequence
2           artists
3         customers
4         employees
5            genres
6          invoices
7     invoice_items
8       media_types
9         playlists
10   playlist_track
11           tracks
12     sqlite_stat1

## Supressing the default index ...

In [21]:
qry = ''' select substr(a.name, 1, 10) as Artist, substr(title, 1, 15) as Album,
t.name as Song from albums r join artists a on (r.artistid = a.artistid) 
join tracks t on (r.albumid = t.albumid)
order by a.name, title
limit 10;'''

pd.read_sql_query(qry, conn, index_col = 'Artist')

                  Album                                     Song
Artist
AC/DC   For Those About  For Those About To Rock (We Salute You)
AC/DC   For Those About                    Put The Finger On You
AC/DC   For Those About                          Let's Get It Up
AC/DC   For Those About                         Inject The Venom
AC/DC   For Those About                               Snowballed
AC/DC   For Those About                               Evil Walks
AC/DC   For Those About                                   C.O.D.
AC/DC   For Those About                       Breaking The Rules
AC/DC   For Those About                 Night Of The Long Knives
AC/DC   For Those About                               Spellbound

## Close the connection

In [22]:
cur.close()
conn.close()